<?php

return [
    'denied_message' => [
        'title' => 'تم الرفض',
        'content' => [
            'intro' => 'عزيزي :firstName,',
            'denied_reason' => ' بأن طلب حسابك قد تم رفضه. لقد قام فريقنا بمراجعة معلوماتك وقرر أنها لا تلبي معاييرنا للموافقة في الوقت الحالي.',
            'reason_details' => 'سبب الرفض: بعد دراسة متأنية، وجدنا أن بعض المعلومات المقدمة لا تتوافق مع متطلباتنا أو إرشاداتنا',
            'next_steps' => 'الخطوات التالية:',
            'next_steps_description' => 'نحن ندرك أنك قد تحتاج إلى تحديث أو تعديل تفاصيل معينة من أجل تلبية معاييرنا. للمضي قدمًا، يرجى النقر على الزر أدناه للوصول إلى حسابك وإجراء التغييرات اللازمة. إذا كانت لديك أي أسئلة أو كنت بحاجة إلى المساعدة، فلا تتردد في التواصل مع فريق الدعم لدينا. نحن نقدر تفهمك وتعاونك',
            'thank_you' => 'شكرًا لك',
            'email_note' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد. من فضلك لا ترد على هذا البريد الإلكتروني.'
        ],
        'buttons' => [
            'proceed_to_update' => 'متابعة الى التحديث'
        ]
    ],
    'subscription_suspended' => [
        'title' => 'تم تعليق الاشتراك',
        'content' => [
            'intro' => 'عزيزي :firstName,',
            'suspended_message' => 'نأمل أن تجدك هذه الرسالة بخير.يؤسفنا إبلاغك بأن اشتراكك الحالي في المطعم  ":restaurantName"  قد تم تعليقه.',
            'renewal_instructions' => 'لمتابعة التجديد وبدء تلقي الطلبات مرة أخرى، يرجى اتباع هذا الرابط: ',
            'renew_link' => 'تجديد الاشتراك',
            'website_subscription' => 'تجديد الاشتراك',
            'app_subscription' => 'تجديد الاشتراك',
            'thank_you_message' => 'شكرا لاختيارك خدماتنا. نحن نقدر شراكتكم ونتطلع إلى مواصلة تعاوننا.',
            'email_note' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
            'message3' => 'فريقنا على استعداد لمساعدتك طوال العملية والإجابة على أي أسئلة قد تكون لديكم.',
            'message1' => 'يسعدنا أن نعلمك أنه تمت الموافقة على مطعمك وهو الآن متاح على منصتنا. يمكن للمستخدمين الوصول إلى مطعمك على عنوان  التالي:',
            ]
    ],
    'subscription_expired' => [
        'title' => 'انتهت صلاحية الاشتراك',
        'message_intro' => 'عزيزي {{ $user->first_name }},',
        'message_body' => 'نأمل أن تجدك هذه الرسالة بخير. يؤسفنا إبلاغك بأن اشتراكك الحالي في المطعم "{{ $restaurant_name }}" قد انتهى. لضمان استمرار نشاط مطعمك دون انقطاع والاستمرار في تقديم خدمة ممتازة لعملائك، نقدم لك فترة سماح مدتها {{$period}} يوم لتجديد اشتراكك.',
        'website_renewal' => 'لمتابعة التجديد يرجى اتباع هذا الرابط:',
         'thank_you' => 'شكرًا لك على اختيار خدماتنا. نحن نقدر شراكتكم ونتطلع إلى مواصلة تعاوننا.',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'app_completed' => [
        'title' => 'تم الانتهاء من تطبيقك',
        'greeting' => 'عزيزي {{ $name }},',
        'message' => 'لقد تمت إضافة تطبيق الهاتف المحمول الجديد الخاص بك بنجاح إلى مطعمك، يمكنك الوصول إليه عن طريق الذهاب إلى صفحة الخدمات."',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'approved_business' => [
        'greeting' => 'عزيزي {{ $user->first_name }},',
        'message1' => 'يسعدنا أن نعلمك أن طلب عملك الذي يحمل المرجع {{$business->business_id}} قد تمت الموافقة عليه بنجاح! نحن نقدر شراكتك ونتطلع إلى مواصلة تعاوننا. ويسعدنا إبلاغك بأن طلب عملك بالمرجع {{$business->business_id}} قد تمت الموافقة عليه بنجاح! نحن نقدر شراكتكم ونتطلع إلى مواصلة تعاوننا.',
        'message2' => 'لمتابعة الخطوات التالية، ندعوك لشراء اشتراكك الجديد باتباع عنوان هذا',
        'message3' => 'فريقنا على استعداد لمساعدتك طوال العملية والإجابة على أي أسئلة قد تكون لديكم.',
        'message4' => 'شكرا لاختيارك خدماتنا. نحن نقدر عملك ونلتزم بتزويدك بأفضل تجربة.',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'approved_restaurant' => [
        'greeting' => 'عزيزي {{ $user->first_name }},',
        'message1' => 'يسعدنا أن نعلمك أنه تمت الموافقة على مطعمك وهو الآن متاح على منصتنا. يمكن للمستخدمين الوصول إلى مطعمك على عنوان  التالي:',
        'message2' => 'شكرا لاختيارك منصتنا. إذا كان لديك أي أسئلة أو كنت بحاجة إلى مزيد من المساعدة، فلا تتردد في الاتصال بنا.',
        'message3' => 'أطيب التحيات،',
        'signature' => 'خردل',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'contact_us' => [
        'message' => 'طلب نموذج جديد.',
        'form_details' => 'تفاصيل النموذج',
        'contact_id' => 'Contact ID : #',
        'email' => 'بريد إلكتروني : ',
        'phone_number' => 'رقم الهاتف : ',
        'business_name' => 'الاسم التجاري : ',
        'person_name' => 'اسم الشخص : ',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'verify' => [
        'verify_email_subject' => 'التحقق من حساب البريد الإلكتروني الخاص بك',
        'dear_name' => 'عزيزي {{ $name }},',
        'verification_code_message' => 'شكرًا لتسجيلك في خردل، رمز التحقق الخاص بك هو:',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'password' => [
        'password_recovery' => 'استعادة كلمة السر',
        'dear_user' => 'عزيزي :name,',
        'reset_password' => 'اعد ضبط كلمه السر',
        'recovery_code' => 'رمز الاسترداد الخاص بك هو:',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.',
    ],
    'notify_users_for_new_sub' => [
        'renew-subscription' => 'تجديد الاشتراك',
        'dear_user' => 'عزيزي {user_name},',
        'notify_message' => 'أردنا أن نعلمك أنه قد تم حجز {sub} جديد من {restaurant_name} (المعرف: {restaurant_id}) بتاريخ {date}. تكلفة هذا الاشتراك هي {cost}.',
        'email_disclaimer' => 'تم إرسال هذا البريد الإلكتروني من عنوان بريد إلكتروني لا يمكنه تلقي رسائل البريد الإلكتروني. الرجاء عدم الرد على هذا البريد الإلكتروني.'
    ]

];

